fluidCellFins/constant/cell4/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/cell4/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    walls_cell
    {
        type            patch;
        nFaces          2631;
        startFace       44825;
    }
    cell4_to_fins
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          295;
        startFace       47456;
        sampleMode      nearestPatchFace;
        sampleRegion    fins;
        samplePatch     fins_to_cell4;
    }
)

// ************************************************************************* //
