fluidCellFins/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet_fluid
    {
        type            patch;
        nFaces          160;
        startFace       74623;
    }
    outlet_fluid
    {
        type            patch;
        nFaces          166;
        startFace       74783;
    }
    walls_fluid
    {
        type            patch;
        nFaces          3096;
        startFace       74949;
    }
    fluid_to_fins
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          4180;
        startFace       78045;
        sampleMode      nearestPatchFace;
        sampleRegion    fins;
        samplePatch     fins_to_fluid;
    }
)

// ************************************************************************* //
